<!-- add-pr-comment:add-pr-comment -->

## dummy-application/uat/core plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.cloud_bucket["learn-gcpdevops-987654764gdfw-gcs-01"].google_storage_bucket.bucket will be created
+   resource "google_storage_bucket" "bucket" {
+       force_destroy               = true
+       id                          = (known after apply)
+       labels                      = {
+           "app" = "gcs"
+           "env" = "uat"
        }
+       location                    = "ASIA-SOUTH1"
+       name                        = "learn-gcpdevops-987654764gdfw-gcs-01"
+       project                     = "icici-terraform-svc-now"
+       public_access_prevention    = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)

+       lifecycle_rule {
+           action {
+               type = "Delete"
            }
+           condition {
+               age                   = 3
+               matches_prefix        = []
+               matches_storage_class = []
+               matches_suffix        = []
+               with_state            = (known after apply)
            }
        }

+       logging {
+           log_bucket        = "log-bucket"
+           log_object_prefix = (known after apply)
        }

+       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   bucket_id        = [
+       (known after apply),
    ]
+   bucket_name      = [
+       "learn-gcpdevops-987654764gdfw-gcs-01",
    ]
+   bucket_self_link = [
+       (known after apply),
    ]
+   bucket_url       = [
+       (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```